Autodesk.Revit.DB.PointRelativeToPoint.SetHostPointReference(Autodesk.Revit.DB.Reference)
Change the host point reference.
Remarks:
Allowed references are to another Autodesk.Revit.DB.ReferencePoint element
or to an Autodesk.Revit.DB.Point.
Since: 2013

Autodesk.Revit.DB.PointRelativeToPoint.GetHostPointReference
Get a copy of the host point reference.
Since: 2013

Autodesk.Revit.DB.PointRelativeToPoint.#ctor(Autodesk.Revit.DB.Reference)
Construct a reference to a point placed relative to a host point.
Since: 2013

Autodesk.Revit.DB.PointRelativeToPoint
Represents a point placed relative to another point.
Remarks:
For this release, the only workflow supported is that the point is
placed coincident with the referenced host (a relative transformation
of Transform.Identity).
Since: 2013